artillery/get-questions.yml
config:
  target: "http://13.57.37.87:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up
    - duration: 120
      arrivalRate: 10
      name: Sustained load
  payload:
    path: "simple-random-test.csv"
    fields:
      - "product_id"

scenarios:
  - name: "Get questions"
    flow:
      - get:
          url: "/qa/questions?product_id={{ product_id }}"